{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel0", 
      "attr": {
        "axis": "2", 
        "num_outputs": "10"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn0", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn1", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_i2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_h2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[33, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[39, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[39, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul0", 
      "inputs": [[41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[39, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul1", 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[43, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul2", 
      "inputs": [[40, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_i2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_h2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[52, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[58, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[58, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul3", 
      "inputs": [[60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[58, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul4", 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[62, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5", 
      "inputs": [[59, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[1, 1, 0], [69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation15", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn2", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution6_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation16", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling4", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn3", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution7_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation17", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution8_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution9_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution9_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation19", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling5", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_i2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[97, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_h2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[49, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation23", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[101, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation22", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[101, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul6", 
      "inputs": [[103, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation20", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation21", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[101, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul7", 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[104, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation24", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul8", 
      "inputs": [[102, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_i2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[110, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_h2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[68, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation28", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[114, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation27", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[114, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul9", 
      "inputs": [[116, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation25", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation26", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[114, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10", 
      "inputs": [[118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[117, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation29", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul11", 
      "inputs": [[115, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution10_weight", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution10_bias", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[1, 2, 0], [124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation30", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling6", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn4", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution11_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution11_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation31", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling7", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn5", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution12_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution12_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation32", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution13_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution13_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[139, 0, 0], [140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation33", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution14_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution14_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation34", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling8", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten2", 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_bias", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_i2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[152, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_h2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[110, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation38", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[156, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation37", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[156, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul12", 
      "inputs": [[158, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation35", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation36", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[156, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul13", 
      "inputs": [[160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[159, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation39", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul14", 
      "inputs": [[157, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_i2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[165, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_h2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[123, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation43", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[169, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation42", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[169, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul15", 
      "inputs": [[171, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation40", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation41", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[169, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul16", 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[172, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation44", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul17", 
      "inputs": [[170, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution15_weight", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution15_bias", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[1, 3, 0], [179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation45", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling9", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn6", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution16_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution16_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation46", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling10", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn7", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution17_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution17_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation47", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution18_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution18_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[194, 0, 0], [195, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation48", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution19_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution19_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[198, 0, 0], [199, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation49", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling11", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten3", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected3_weight", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected3_bias", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected3", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": [[204, 0, 0], [205, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_i2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[207, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_h2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[165, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation53", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[211, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation52", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[211, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul18", 
      "inputs": [[213, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation50", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation51", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[211, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul19", 
      "inputs": [[215, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[214, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation54", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul20", 
      "inputs": [[212, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_i2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[220, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_h2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[178, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[221, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation58", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[224, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation57", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[224, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul21", 
      "inputs": [[226, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation55", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation56", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[224, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul22", 
      "inputs": [[228, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[227, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation59", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul23", 
      "inputs": [[225, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution20_weight", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution20_bias", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[1, 4, 0], [234, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation60", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[236, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling12", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn8", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution21_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution21_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[239, 0, 0], [240, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation61", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling13", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn9", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution22_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution22_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[245, 0, 0], [246, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation62", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution23_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution23_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution23", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[249, 0, 0], [250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation63", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution24_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution24_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[253, 0, 0], [254, 0, 0], [255, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation64", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling14", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[257, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten4", 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected4_weight", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected4_bias", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected4", 
      "attr": {"num_hidden": "4096"}, 
      "inputs": [[259, 0, 0], [260, 0, 0], [261, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_i2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[262, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_h2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[220, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[263, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[265, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation68", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[266, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation67", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[266, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul24", 
      "inputs": [[268, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation65", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation66", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[266, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul25", 
      "inputs": [[270, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[269, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation69", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul26", 
      "inputs": [[267, 0, 0], [274, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_i2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[275, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_h2h", 
      "attr": {"num_hidden": "16384"}, 
      "inputs": [[233, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus18", 
      "inputs": [[276, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation73", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[279, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation72", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[279, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul27", 
      "inputs": [[281, 0, 0], [231, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation70", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation71", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[279, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul28", 
      "inputs": [[283, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[282, 0, 0], [285, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation74", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul29", 
      "inputs": [[280, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution25_weight", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution25_bias", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[1, 5, 0], [289, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation75", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling15", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn10", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[293, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution26_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution26_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution26", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "256", 
        "pad": "(2, 2)"
      }, 
      "inputs": [[294, 0, 0], [295, 0, 0], [296, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation76", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[297, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling16", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "LRN", 
      "name": "lrn11", 
      "attr": {
        "alpha": "0.0001", 
        "beta": "0.75", 
        "knorm": "1", 
        "nsize": "5"
      }, 
      "inputs": [[299, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution27_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution27_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution27", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[300, 0, 0], [301, 0, 0], [302, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation77", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution28_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution28_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution28", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[304, 0, 0], [305, 0, 0], [306, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation78", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution29_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution29_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
